%% 数学实验第十一周作业
% 
% 
% 学号：202023092020
% 
% 姓名：冯健齐
%% 
% 
%% P85 2(1)

%题目条件
f=@(x,y) y+2*x;%给定函数
start=[0 1];%初始条件
tspan=[0:0.01:1];%间距
x=tspan;
y=3*exp(x)-2*x-2;%精确解
%欧拉方法求解
y1=odeuler(f,0,0.01,1,1);
plot(tspan,y1,'-',tspan,y,'-');
legend('欧拉方法解','精确解');
title('欧拉方法求解');
s1=wucha(tspan,y1,y)
%龙格-库塔方法
[tspan, y2]=ode45(f,tspan,1);
plot(tspan,y2,'-',tspan,y,'-');
legend('龙格-库塔方法解','精确解');
title('龙格-库塔方法求解');
s2=wucha(tspan,y2,y)
%% 
% 由图像与平均误差可以看出，龙格-库塔方法的结果平均误差极小，且其函数图像与精确解重合。
%% P85 2(3)

%题目条件,涉及到两个方程的解
y0=[-2/pi 2];%初始条件
i=0;
for k=[pi 2*pi/3 7*pi/12 13*pi/24]
    i=i+1;
    figure(i);
    num=k-pi/2;
    tspan=linspace(pi/2,k,100);%间距
    x=tspan;
    y=sin(x).*(2.*pi./x).^(1/2);%精确解
    %龙格-库塔方法
    [tspan, y2]=ode45('bessel',tspan,y0);
    plot(tspan,y2(:,2),'-o',tspan,y,'-');
    legend('龙格-库塔方法解','原函数');
    title(['龙格-库塔方法求解,区间长度为',num2str(num)]);
    yy2=(y2(:,2))';
    s=wucha(tspan,yy2,y)
end
%% 
% 可见，在所给点的附近求解较为准确，当区间长度变短时，平均误差会变小。
%% P86 5
% (1)建立模型
% 假设下面变量
% 
% $m$ 桶的质量（$\textrm{kg}$）
% 
% $g$ 重力加速度（$m$/$s^2$）
% 
% $F_{\textrm{up}}$ 圆筒所受的浮力（$N$)
% 
% $f$ 圆桶所受的阻力（$N$）
% 
% $s$ 圆桶从0时刻开始下降的距离（$m$）
% 
% $t$ 圆桶从0时刻开始下降的时间（$s$）
% 
% $v$ 圆桶的速度（$m/s^2$)
% 
% $k$ 阻力与下沉速度的比例系数（$N\;\frac{s}{m}$）
% 
% 由物理学知识，可以知道，在下降过程中，对桶进行受力分析，有
% 
% $\textrm{mg}-F_{\textrm{up}} -f=m\frac{d^2 s}{{\textrm{dt}}^2 }$,由题目所给条件，可知$f=\textrm{kv}=k\frac{\textrm{ds}}{\textrm{dt}}$,
% 
% 
% 
% *综合上两式，可以得到二阶常微分方程组*$\textrm{mg}-F_{\textrm{up}} -k\frac{\textrm{ds}}{\textrm{dt}}=m\frac{d^2 
% s}{{\textrm{dt}}^2 }$
% 
% *且方程初始位置为*$t=0$*时*$\frac{\textrm{ds}}{\textrm{dt}}=0,\frac{d^2 s}{{\textrm{dt}}^2 
% }=0$*.*
% 
% 
% (2)求解方程
% 
% *数值求解*

%输入数据,化为单位制
m=527.436*0.4536;
g=9.8;
fup=470.327*0.4536*9.8;
k=0.08*0.4536*9.8/0.3048;
vmax=40*0.3048;
smax=300*0.3048;
a=(m*g-fup)/m;
t=linspace(0,15,100);
y0=[0 0];
[t, y1]=ode45('df3',t,y0);
%第一列解为s，第二列解为v
plot(t,y1(:,1));
title('下降距离s与时间（数值解）');
xlabel('t(秒）');
ylabel('s(米）');
plot(t,y1(:,2));
title('下降速度v与时间（数值解）');
xlabel('t(秒）');
ylabel('v(米每秒）');
%% 
% 可见，当s达到smax=91.44米时，速度已经超过13米每秒，超过了vmax=12.1920米每秒，可知，工程师说得对，不应该投放。
% 
% 
% *解析求解*

y01=dsolve('m*D2y-m*g+fup+k*Dy=0','y(0)=0,Dy(0)=0','t');
%方程解为
disp(y01);
%代入数据后
y02=dsolve('527.436*0.4536*D2y-527.436*0.4536*9.8+470.327*0.4536*9.8+0.08*0.4536*9.8/0.3048*Dy=0','y(0)=0,Dy(0)=0','t');
disp(y02);
f=@(t) (6346637388000000000000000000000000*t)/29168503937007874015748031496063 + (37960026723857085120000000000000000000000000000000000000000000000000*exp(-(29168503937007874015748031496063*t)/5981124240000000000000000000000000))/850801621923243846487692975385951231248062496124992249984499969 - 37960026723857085120000000000000000000000000000000000000000000000000/850801621923243846487692975385951231248062496124992249984499969;
t01=linspace(0,15,100);
plot(t01,f(t01));
title('下降距离s与时间（解析解）');
xlabel('t(秒）');
ylabel('s(米）');
ss=wucha(t01,f(t01),y1(:,1))
%% 
% 

%速度解（求导）
syms t;
f=@(t) (6346637388000000000000000000000000*t)/29168503937007874015748031496063 + (37960026723857085120000000000000000000000000000000000000000000000000*exp(-(29168503937007874015748031496063*t)/5981124240000000000000000000000000))/850801621923243846487692975385951231248062496124992249984499969 - 37960026723857085120000000000000000000000000000000000000000000000000/850801621923243846487692975385951231248062496124992249984499969;
v=diff(f,t);
disp(v);
fv=@(t) 5548175556775168/25498854066721 - (584102541013334276306499972719104*exp(-(3238354466473567*t)/664038184439164032))/2684476239240870730335775089409;
plot(t01,fv(t01));
title('下降速度v与时间（解析解）');
xlabel('t(秒）');
ylabel('v(米每秒）');
sv=wucha(t01,fv(t01),y1(:,2))
%% 
% 以上为公式解与带入后的数值解析解。由误差函数也可见，下降距离解析解与数值解平均差距为1.884359335235786e-11，下降速度的平均差值为4.263256414560601e-14，均可以忽略。进一步验证了前面的公式。
% 
% 
% 
% 综上所述，工程师说法正确，不应该投放。
%% 附录
% 欧拉方法求解公式

function y = odeuler(odefun, t0, h, tfinal, y0)
t = t0 : h : tfinal; 
y = zeros(size(t)); 
y(1) = y0; 
for k = 1 : (length(t)-1)
    s = odefun(t(k), y(k)); 
    y(k+1) = y(k) + h * s; 
end
end
% 平均误差函数

function s=wucha(x,y1,y2)
%x为自变量，y1为一个函数值，y2为另一函数值
t=length(x);
s=0;
for i=1:t
    s=s+abs(y1(t)-y2(t));
end
s=s/t;
end
% 贝塞尔方程函数bessel

function dy=bessel(x,y)
dy=zeros(2,1);%定义列向量
%y1=y,y2=y'
dy(1)=y(2);
dy(2)=((x^2-0.5^2)*y(1)+x*y(2))/(-x^2);
end
% 第五题建模函数df3

function dy=df3(x,y)
%要用到的常数
m=527.436*0.4536;
g=9.8;
fup=470.327*0.4536*9.8;
k=0.08*0.4536*9.8/0.3048;
%解方程y1=y,y2=y'
dy=zeros(2,1);
dy(1)=y(2);
dy(2)=(m*g-fup-k*y(2))/m;
end