%录入各个矩阵的值
B=[1 2 5;1/2 1 2;1/5 1/2 1];%B1
B=[B [1 1/3 1/8;3 1 1/3;8 3 1]];%B2
B=[B [1 1 3;1 1 3;1/3 1/3 1]];%B3
B=[B [1 3 4;1/3 1 1;1/4 1 1]];%B4
B=[B [1 1 1/4;1 1 1/4;4 4 1]];%B5
for i=1:5
    A=B(:,[3*i-2:3*i]);
    disp(['B',num2str(i)])
    [n,n] = size(A);

%特征值法求权重
[V,D] = eig(A);
Max_eig = max(max(D));%求最大特征值
[r,c]=find(D == Max_eig , 1);
disp('特征值法求权重的结果为：');
%找到最大的特征值对应的特征向量
disp( V(:,c) ./ sum(V(:,c)) )

%下面计算一致性比例CR
CI = (Max_eig - n) / (n-1);
RI=[ 0 1e-10 0.50453 0.90884 1.13579 1.28758 1.39181 1.42631 1.46843 1.51110 1.54223];
% 这里n=2时，一定是一致矩阵，所以CI=0，为了避免分母为0，
%将这里的第二个元素改为了很接近0的正数
CR=CI/RI(n);
disp('一致性指标CI=');disp(CI);
disp('一致性比例CR=');disp(CR);
if CR<0.10
    disp('CR < 0.10，所以该判断矩阵A的一致性可以接受');
else
    disp('CR >= 0.10，该判断矩阵A需要进行修改');
end
end